app/controllers/users_controller.rb

	def create
		@user = User.new user_params
		if @user.save
---
INSERT INTO `users` (`name`, `password_digest`, `created_at`, `updated_at`) VALUES ('thanh bang', '$2a$10$DMA2wwq4IloV5DniWnL3qeaHF9888Mocu9OPVjCUqUmy6FD/R4cg.', '2018-02-08 03:52:28', '2018-02-08 03:52:28')

	def show
		@user = User.find_by id:params[:id]
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 0 LIMIT 1